In [1]:
import pandas as pd

In [2]:
 #movies= pd.read_clipboard()

In [3]:
# movies

In [4]:
movies = pd.read_csv(r'Book1.csv')   ### r is used to copy path

In [5]:
movies

    id          name    industry       genre language  duration  rating
0    1      bahubali   tollywood      action   telugu       170     9.5
1    2    brahmastra   bollywood  mysterious    hindi       180     5.0
2    3           uri  bollywoood      action    hindi       120    10.0
3    4          ddlj   bollywood       drama    hindi       150    10.0
4    5      avengers   hollywood      action  english       210     9.0
5    6         tenet   hollywood      sci fi  english       150     8.5
6    7         major   bollywood      action    hindi       140     8.0
7    8  interstellar   hollywood      sci fi  english       190     7.0
8    9       gravity   hollywood      sci fi  english       130     6.0
9   10       titanic   hollywood       drama  english       180     9.0
10  11        jawani   bollywood    romantic    hindi       150     5.0
11  12      houseful   bollywood      comedy    hindi        10     6.0
12  13      dictator   hollywood      comedy  english       120     7.0
13  14    hera pheri   bollywood      comedy    hindi       140     9.0
14  15        sholay   bollywood       drama    hindi       150     8.5

In [6]:
movies.head()

   id        name    industry       genre language  duration  rating
0   1    bahubali   tollywood      action   telugu       170     9.5
1   2  brahmastra   bollywood  mysterious    hindi       180     5.0
2   3         uri  bollywoood      action    hindi       120    10.0
3   4        ddlj   bollywood       drama    hindi       150    10.0
4   5    avengers   hollywood      action  english       210     9.0

# find the longest movie

In [7]:
movies['duration'].max()

210

In [8]:
movies['duration'].argmax()

4

In [9]:
movies['name'][4]

'avengers'

In [10]:
movies['name'][movies['duration'].argmax()]

'avengers'

# number of movies who got 10 rating

In [11]:
movies['name'][movies['rating'].argmax()]

'uri'

In [12]:
movies['rating']==10

0     False
1     False
2      True
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: rating, dtype: bool

In [13]:
sum(movies['rating']==10)

2

# how many industries are there

In [14]:
movies['industry'].value_counts()

bollywood     7
hollywood     6
tollywood     1
bollywoood    1
Name: industry, dtype: int64

In [15]:
movies['industry'].value_counts().count()

4

In [16]:
len(movies['industry'].value_counts())

4

In [17]:
movies['industry'].nunique()

4

# find the least liked comedy movie name

In [18]:
movies['genre']=='comedy'

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12     True
13     True
14    False
Name: genre, dtype: bool

In [19]:
movies[movies['genre']=='comedy']

    id        name   industry   genre language  duration  rating
11  12    houseful  bollywood  comedy    hindi        10     6.0
12  13    dictator  hollywood  comedy  english       120     7.0
13  14  hera pheri  bollywood  comedy    hindi       140     9.0

In [20]:
movies[movies['genre']=='comedy']['rating'].min()

6.0

In [21]:
movies[movies['genre']=='comedy']['rating'].argmin()

0

In [22]:
movies['name'][movies[movies['genre']=='comedy']['rating'].idxmin()]

'houseful'

In [23]:
movies.columns

Index(['id', 'name', 'industry', 'genre', 'language', 'duration', 'rating'], dtype='object')

In [24]:
# longest english movie

In [25]:
movies['name'][movies[movies['language']=='english']['duration'].idxmax()]

'avengers'

In [26]:
movies['name']=='ddlj'

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: name, dtype: bool

In [27]:
movies['name'][9]

'titanic'

# what is genre of interstellar

In [28]:
movies['name']=='interstellar'  # it is not an efficient method as it can be a lenghty method

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: name, dtype: bool

In [29]:
movies['genre'][movies['name']=='interstellar']

7    sci fi
Name: genre, dtype: object

In [30]:
movies['genre'][7]

'sci fi'

In [31]:
movies['genre'][movies['name']=='interstellar'].values # .values is an attribute which converts series into numpy array.

array(['sci fi'], dtype=object)

In [32]:
movies['genre'][movies['name']=='interstellar'].values[0]

'sci fi'

In [33]:
'hello'.upper()

'HELLO'

In [34]:
'hello'.split('e')

['h', 'llo']

In [35]:
movies['name'].str.upper()

0         BAHUBALI
1       BRAHMASTRA
2              URI
3             DDLJ
4         AVENGERS
5            TENET
6            MAJOR
7     INTERSTELLAR
8          GRAVITY
9          TITANIC
10          JAWANI
11        HOUSEFUL
12        DICTATOR
13      HERA PHERI
14          SHOLAY
Name: name, dtype: object

In [36]:
movies['genre'][movies['name'].str.lower()=='interstellar'.lower()].values[0]

'sci fi'

In [37]:
name=movies['name']

In [38]:
name.values

array(['bahubali', 'brahmastra', 'uri', 'ddlj', 'avengers', 'tenet',
       'major', 'interstellar', 'gravity', 'titanic', 'jawani',
       'houseful', 'dictator', 'hera pheri', 'sholay'], dtype=object)

In [39]:
name.str.capitalize()

0         Bahubali
1       Brahmastra
2              Uri
3             Ddlj
4         Avengers
5            Tenet
6            Major
7     Interstellar
8          Gravity
9          Titanic
10          Jawani
11        Houseful
12        Dictator
13      Hera pheri
14          Sholay
Name: name, dtype: object

In [40]:
name.str.find('e')

0    -1
1    -1
2    -1
3    -1
4     2
5     1
6    -1
7     3
8    -1
9    -1
10   -1
11    4
12   -1
13    1
14   -1
Name: name, dtype: int64

In [41]:
name.str.endswith('i')

0      True
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13     True
14    False
Name: name, dtype: bool

In [42]:
name.str.get(-2)

0     l
1     r
2     r
3     l
4     r
5     e
6     o
7     a
8     t
9     i
10    n
11    u
12    o
13    r
14    a
Name: name, dtype: object

In [43]:
name.str.get_dummies()

,avengers,bahubali,brahmastra,ddlj,dictator,gravity,hera pheri,houseful,interstellar,jawani,major,sholay,tenet,titanic,uri
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0
4,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0
5,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
6,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
7,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
8,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0
9,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
10,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0
11,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0
12,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
13,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
14,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0

In [44]:
movies['genre'].str.get_dummies()  # used to convert string into binary

    action  comedy  drama  mysterious  romantic  sci fi
0        1       0      0           0         0       0
1        0       0      0           1         0       0
2        1       0      0           0         0       0
3        0       0      1           0         0       0
4        1       0      0           0         0       0
5        0       0      0           0         0       1
6        1       0      0           0         0       0
7        0       0      0           0         0       1
8        0       0      0           0         0       1
9        0       0      1           0         0       0
10       0       0      0           0         1       0
11       0       1      0           0         0       0
12       0       1      0           0         0       0
13       0       1      0           0         0       0
14       0       0      1           0         0       0

In [45]:
# name.str.index('e')

In [46]:
name.str.join('.')

0             b.a.h.u.b.a.l.i
1         b.r.a.h.m.a.s.t.r.a
2                       u.r.i
3                     d.d.l.j
4             a.v.e.n.g.e.r.s
5                   t.e.n.e.t
6                   m.a.j.o.r
7     i.n.t.e.r.s.t.e.l.l.a.r
8               g.r.a.v.i.t.y
9               t.i.t.a.n.i.c
10                j.a.w.a.n.i
11            h.o.u.s.e.f.u.l
12            d.i.c.t.a.t.o.r
13        h.e.r.a. .p.h.e.r.i
14                s.h.o.l.a.y
Name: name, dtype: object

In [47]:
name.str.split('e')

0           [bahubali]
1         [brahmastra]
2                [uri]
3               [ddlj]
4         [av, ng, rs]
5            [t, n, t]
6              [major]
7     [int, rst, llar]
8            [gravity]
9            [titanic]
10            [jawani]
11         [hous, ful]
12          [dictator]
13      [h, ra ph, ri]
14            [sholay]
Name: name, dtype: object

In [48]:
name.str.split('e').str.join('--+--')

0                 bahubali
1               brahmastra
2                      uri
3                     ddlj
4         av--+--ng--+--rs
5            t--+--n--+--t
6                    major
7     int--+--rst--+--llar
8                  gravity
9                  titanic
10                  jawani
11            hous--+--ful
12                dictator
13      h--+--ra ph--+--ri
14                  sholay
Name: name, dtype: object

In [49]:
name.str.strip() # used to remove trailing and forward spaces present

0         bahubali
1       brahmastra
2              uri
3             ddlj
4         avengers
5            tenet
6            major
7     interstellar
8          gravity
9          titanic
10          jawani
11        houseful
12        dictator
13      hera pheri
14          sholay
Name: name, dtype: object

In [50]:
movies['genre'][movies['name'].str.strip().str.lower()=='interstellar'.lower()].values[0] ##safe to use now as the spaces are removed if present

'sci fi'

# what is the average duration of each genre

In [51]:
movies['genre'].unique()

array(['action', 'mysterious', 'drama', 'sci fi', 'romantic', 'comedy'],
      dtype=object)

In [52]:
movies['genre'].nunique()

6

In [53]:
movies['genre'].value_counts()

action        4
drama         3
sci fi        3
comedy        3
mysterious    1
romantic      1
Name: genre, dtype: int64

In [54]:
for genre in movies['genre'].unique():
    print(genre,movies[movies['genre']==genre]['duration'].mean())

action 160.0
mysterious 180.0
drama 160.0
sci fi 156.66666666666666
romantic 150.0
comedy 90.0

In [55]:
movies.groupby('genre')['duration'].mean()  # groupby is a panda lib. function

genre
action        160.000000
comedy         90.000000
drama         160.000000
mysterious    180.000000
romantic      150.000000
sci fi        156.666667
Name: duration, dtype: float64

In [56]:
movies.groupby(['genre','duration'])['duration'].mean()

genre       duration
action      120         120.0
            140         140.0
            170         170.0
            210         210.0
comedy      10           10.0
            120         120.0
            140         140.0
drama       150         150.0
            180         180.0
mysterious  180         180.0
romantic    150         150.0
sci fi      130         130.0
            150         150.0
            190         190.0
Name: duration, dtype: float64

In [57]:
movies.groupby(['duration','genre'])['duration'].mean()

duration  genre
10        comedy         10.0
120       action        120.0
          comedy        120.0
130       sci fi        130.0
140       action        140.0
          comedy        140.0
150       drama         150.0
          romantic      150.0
          sci fi        150.0
170       action        170.0
180       drama         180.0
          mysterious    180.0
190       sci fi        190.0
210       action        210.0
Name: duration, dtype: float64

In [58]:
movies.describe()

              id   duration     rating
count  15.000000   15.00000  15.000000
mean    8.000000  146.00000   7.833333
std     4.472136   45.63833   1.718249
min     1.000000   10.00000   5.000000
25%     4.500000  135.00000   6.500000
50%     8.000000  150.00000   8.500000
75%    11.500000  175.00000   9.000000
max    15.000000  210.00000  10.000000

In [59]:
movies.drop('id',axis=1)

            name    industry       genre language  duration  rating
0       bahubali   tollywood      action   telugu       170     9.5
1     brahmastra   bollywood  mysterious    hindi       180     5.0
2            uri  bollywoood      action    hindi       120    10.0
3           ddlj   bollywood       drama    hindi       150    10.0
4       avengers   hollywood      action  english       210     9.0
5          tenet   hollywood      sci fi  english       150     8.5
6          major   bollywood      action    hindi       140     8.0
7   interstellar   hollywood      sci fi  english       190     7.0
8        gravity   hollywood      sci fi  english       130     6.0
9        titanic   hollywood       drama  english       180     9.0
10        jawani   bollywood    romantic    hindi       150     5.0
11      houseful   bollywood      comedy    hindi        10     6.0
12      dictator   hollywood      comedy  english       120     7.0
13    hera pheri   bollywood      comedy    hindi       140     9.0
14        sholay   bollywood       drama    hindi       150     8.5

In [60]:
movies.head()

   id        name    industry       genre language  duration  rating
0   1    bahubali   tollywood      action   telugu       170     9.5
1   2  brahmastra   bollywood  mysterious    hindi       180     5.0
2   3         uri  bollywoood      action    hindi       120    10.0
3   4        ddlj   bollywood       drama    hindi       150    10.0
4   5    avengers   hollywood      action  english       210     9.0

In [61]:
# movies.drop('id',axis=1,inplace=True)

In [62]:
movies.head()

   id        name    industry       genre language  duration  rating
0   1    bahubali   tollywood      action   telugu       170     9.5
1   2  brahmastra   bollywood  mysterious    hindi       180     5.0
2   3         uri  bollywoood      action    hindi       120    10.0
3   4        ddlj   bollywood       drama    hindi       150    10.0
4   5    avengers   hollywood      action  english       210     9.0

In [63]:
movies = pd.read_csv(r'Book1.csv',index_col= 0)

In [64]:
movies

            name    industry       genre language  duration  rating
id
1       bahubali   tollywood      action   telugu       170     9.5
2     brahmastra   bollywood  mysterious    hindi       180     5.0
3            uri  bollywoood      action    hindi       120    10.0
4           ddlj   bollywood       drama    hindi       150    10.0
5       avengers   hollywood      action  english       210     9.0
6          tenet   hollywood      sci fi  english       150     8.5
7          major   bollywood      action    hindi       140     8.0
8   interstellar   hollywood      sci fi  english       190     7.0
9        gravity   hollywood      sci fi  english       130     6.0
10       titanic   hollywood       drama  english       180     9.0
11        jawani   bollywood    romantic    hindi       150     5.0
12      houseful   bollywood      comedy    hindi        10     6.0
13      dictator   hollywood      comedy  english       120     7.0
14    hera pheri   bollywood      comedy    hindi       140     9.0
15        sholay   bollywood       drama    hindi       150     8.5

In [65]:
movies.sample(3)

            name   industry     genre language  duration  rating
id
11        jawani  bollywood  romantic    hindi       150     5.0
8   interstellar  hollywood    sci fi  english       190     7.0
10       titanic  hollywood     drama  english       180     9.0

In [66]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15 entries, 1 to 15
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      15 non-null     object
 1   industry  15 non-null     object
 2   genre     15 non-null     object
 3   language  15 non-null     object
 4   duration  15 non-null     int64
 5   rating    15 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 840.0+ bytes

In [67]:
movies.describe(include='all')

            name   industry   genre language   duration     rating
count         15         15      15       15   15.00000  15.000000
unique        15          4       6        3        NaN        NaN
top     bahubali  bollywood  action    hindi        NaN        NaN
freq           1          7       4        8        NaN        NaN
mean         NaN        NaN     NaN      NaN  146.00000   7.833333
std          NaN        NaN     NaN      NaN   45.63833   1.718249
min          NaN        NaN     NaN      NaN   10.00000   5.000000
25%          NaN        NaN     NaN      NaN  135.00000   6.500000
50%          NaN        NaN     NaN      NaN  150.00000   8.500000
75%          NaN        NaN     NaN      NaN  175.00000   9.000000
max          NaN        NaN     NaN      NaN  210.00000  10.000000

In [68]:
movies.groupby('industry').describe()

           duration                                                            \
              count        mean        std    min    25%    50%    75%    max
industry
bollywood       7.0  131.428571  55.205245   10.0  140.0  150.0  150.0  180.0
bollywoood      1.0  120.000000        NaN  120.0  120.0  120.0  120.0  120.0
hollywood       6.0  163.333333  35.590261  120.0  135.0  165.0  187.5  210.0
tollywood       1.0  170.000000        NaN  170.0  170.0  170.0  170.0  170.0

           rating
            count       mean       std   min   25%    50%     75%   max
industry
bollywood     7.0   7.357143  2.014826   5.0   5.5   8.00   8.750  10.0
bollywoood    1.0  10.000000       NaN  10.0  10.0  10.00  10.000  10.0
hollywood     6.0   7.750000  1.254990   6.0   7.0   7.75   8.875   9.0
tollywood     1.0   9.500000       NaN   9.5   9.5   9.50   9.500   9.5

In [69]:
movies.groupby('industry').describe().T # for taking transpose of a data table

industry         bollywood  bollywoood   hollywood  tollywood
duration count    7.000000         1.0    6.000000        1.0
         mean   131.428571       120.0  163.333333      170.0
         std     55.205245         NaN   35.590261        NaN
         min     10.000000       120.0  120.000000      170.0
         25%    140.000000       120.0  135.000000      170.0
         50%    150.000000       120.0  165.000000      170.0
         75%    150.000000       120.0  187.500000      170.0
         max    180.000000       120.0  210.000000      170.0
rating   count    7.000000         1.0    6.000000        1.0
         mean     7.357143        10.0    7.750000        9.5
         std      2.014826         NaN    1.254990        NaN
         min      5.000000        10.0    6.000000        9.5
         25%      5.500000        10.0    7.000000        9.5
         50%      8.000000        10.0    7.750000        9.5
         75%      8.750000        10.0    8.875000        9.5
         max     10.000000        10.0    9.000000        9.5

In [70]:
movies.groupby(['industry','genre']).describe()

                      duration                                              \
                         count        mean        std    min    25%    50%
industry   genre
bollywood  action          1.0  140.000000        NaN  140.0  140.0  140.0
           comedy          2.0   75.000000  91.923882   10.0   42.5   75.0
           drama           2.0  150.000000   0.000000  150.0  150.0  150.0
           mysterious      1.0  180.000000        NaN  180.0  180.0  180.0
           romantic        1.0  150.000000        NaN  150.0  150.0  150.0
bollywoood action          1.0  120.000000        NaN  120.0  120.0  120.0
hollywood  action          1.0  210.000000        NaN  210.0  210.0  210.0
           comedy          1.0  120.000000        NaN  120.0  120.0  120.0
           drama           1.0  180.000000        NaN  180.0  180.0  180.0
           sci fi          3.0  156.666667  30.550505  130.0  140.0  150.0
tollywood  action          1.0  170.000000        NaN  170.0  170.0  170.0

                                    rating                                     \
                         75%    max  count       mean       std   min     25%
industry   genre
bollywood  action      140.0  140.0    1.0   8.000000       NaN   8.0   8.000
           comedy      107.5  140.0    2.0   7.500000  2.121320   6.0   6.750
           drama       150.0  150.0    2.0   9.250000  1.060660   8.5   8.875
           mysterious  180.0  180.0    1.0   5.000000       NaN   5.0   5.000
           romantic    150.0  150.0    1.0   5.000000       NaN   5.0   5.000
bollywoood action      120.0  120.0    1.0  10.000000       NaN  10.0  10.000
hollywood  action      210.0  210.0    1.0   9.000000       NaN   9.0   9.000
           comedy      120.0  120.0    1.0   7.000000       NaN   7.0   7.000
           drama       180.0  180.0    1.0   9.000000       NaN   9.0   9.000
           sci fi      170.0  190.0    3.0   7.166667  1.258306   6.0   6.500
tollywood  action      170.0  170.0    1.0   9.500000       NaN   9.5   9.500


                         50%     75%   max
industry   genre
bollywood  action       8.00   8.000   8.0
           comedy       7.50   8.250   9.0
           drama        9.25   9.625  10.0
           mysterious   5.00   5.000   5.0
           romantic     5.00   5.000   5.0
bollywoood action      10.00  10.000  10.0
hollywood  action       9.00   9.000   9.0
           comedy       7.00   7.000   7.0
           drama        9.00   9.000   9.0
           sci fi       7.00   7.750   8.5
tollywood  action       9.50   9.500   9.5

# what is the average rating of each industry

In [71]:
movies.groupby('industry')['rating'].mean()

industry
bollywood      7.357143
bollywoood    10.000000
hollywood      7.750000
tollywood      9.500000
Name: rating, dtype: float64

# average rating of romantic movies industry wise

In [72]:
movies[movies['genre'].str.lower()=='romantic'].groupby('industry')['rating'].mean()

industry
bollywood    5.0
Name: rating, dtype: float64

# list down all the english movies with their respective ratings in descending order

In [73]:
movies[movies['language'].str.lower()=='english'][['name','rating']]

            name  rating
id
5       avengers     9.0
6          tenet     8.5
8   interstellar     7.0
9        gravity     6.0
10       titanic     9.0
13      dictator     7.0

In [74]:
movies[movies['language'].str.lower()=='english'][['name','rating']].sort_values(by='rating')

            name  rating
id
9        gravity     6.0
8   interstellar     7.0
13      dictator     7.0
6          tenet     8.5
5       avengers     9.0
10       titanic     9.0

In [75]:
movies[movies['language'].str.lower()=='english'][['name','rating']].sort_values(by='rating',ascending=False)

            name  rating
id
5       avengers     9.0
10       titanic     9.0
6          tenet     8.5
8   interstellar     7.0
13      dictator     7.0
9        gravity     6.0

In [77]:
import numpy as np
import pandas as pd

In [80]:
data={'country':['india','usa','japan','china','india','usa'],'year':['2102','2010','2010','2015','2015','2015'],
      'continent':['asia','na','asia','asia','asia','na'],
      'value':[20,10,40,50,60,55]
     }

In [78]:
df = pd.DataFrame(data)

In [79]:
df

  country  year continent  value
0   india  2102      asia     20
1     usa  2010        na     10
2   japan  2010      asia     40
3   china  2015      asia     50
4   india  2015      asia     60
5     usa  2015        na     55

In [85]:
pd.pivot_table(df,index=['year'],aggfunc='sum')

      value
year
2010     50
2015    165
2102     20

In [83]:
pd.pivot_table(df,index=['continent'],aggfunc='sum')

           value
continent
asia         170
na            65

# concat

In [87]:
people1={'id':[1,2,3,4],
         'name':['ab','rf','kl','ed'],
         'age':[45,25,41,30]
        }

In [88]:
people2={'id':[11,22,33,44],
         'name':['awb','rgf','kal','ejqd'],
         'age':[35,15,40,35]
        }

In [91]:
people3={'id':[111,222,333,444],
         'name':['oab','rnf','kal','ecd'],
         'age':[55,75,81,50]
        }

In [92]:
df1=pd.DataFrame(people1)
df2=pd.DataFrame(people2)
df3=pd.DataFrame(people3)

In [93]:
df1

    id name  age
0  111  oab   55
1  222  rnf   75
2  333  kal   81
3  444  ecd   50

In [94]:
df2

   id  name  age
0  11   awb   35
1  22   rgf   15
2  33   kal   40
3  44  ejqd   35

In [95]:
df3

    id name  age
0  111  oab   55
1  222  rnf   75
2  333  kal   81
3  444  ecd   50

In [96]:
pd.concat([df1,df2,df3])

    id  name  age
0  111   oab   55
1  222   rnf   75
2  333   kal   81
3  444   ecd   50
0   11   awb   35
1   22   rgf   15
2   33   kal   40
3   44  ejqd   35
0  111   oab   55
1  222   rnf   75
2  333   kal   81
3  444   ecd   50

In [97]:
pd.concat([df1,df2,df3],ignore_index=True)

     id  name  age
0   111   oab   55
1   222   rnf   75
2   333   kal   81
3   444   ecd   50
4    11   awb   35
5    22   rgf   15
6    33   kal   40
7    44  ejqd   35
8   111   oab   55
9   222   rnf   75
10  333   kal   81
11  444   ecd   50

In [98]:
pd.concat([df1,df2,df3],axis=1)

    id name  age  id  name  age   id name  age
0  111  oab   55  11   awb   35  111  oab   55
1  222  rnf   75  22   rgf   15  222  rnf   75
2  333  kal   81  33   kal   40  333  kal   81
3  444  ecd   50  44  ejqd   35  444  ecd   50

In [99]:
people4={'id':[1,2,3,4],
         'name':['ab','rf','kl','ed'],
         'age':[45,25,41,30]
        }
people5={'id':[1,2,3,4],
         'name':['ab','rf','kl','ed'],
         'sales':[535,415,540,235]
        }

In [100]:

df4=pd.DataFrame(people4)

df5=pd.DataFrame(people5)

In [101]:
pd.merge(df4,df5,on=['id','name'])

   id name  age  sales
0   1   ab   45    535
1   2   rf   25    415
2   3   kl   41    540
3   4   ed   30    235

In [102]:
people6={'id':[1,2,3,4],
         'name':['ab','rf','kl','ed'],
         'age':[45,25,41,30]
        }
people7={
         's_name':['b','r','l','d'],
         'phone':[1255535,555555415,222222540,466656235]
        }

In [103]:
df6=pd.DataFrame(people6)
df7=pd.DataFrame(people7)

In [104]:
df6.join(df7)

   id name  age s_name      phone
0   1   ab   45      b    1255535
1   2   rf   25      r  555555415
2   3   kl   41      l  222222540
3   4   ed   30      d  466656235

In [107]:
d1=pd.read_csv('mytsv.tsv')
d1

    name\t\tage\troll
0  'akash'\t\t21\t100
1   'akasht'\t22\t101
2  'sunny'\t\t20\t102
3  'bunny'\t\t25\t104
4  'ashis'\t\t24\t105

In [114]:
d1=pd.read_csv('mytsv.tsv',sep='\t')
d1

       name  Unnamed: 1  age   roll
0   'akash'         NaN   21  100.0
1  'akasht'        22.0  101    NaN
2   'sunny'         NaN   20  102.0
3   'bunny'         NaN   25  104.0
4   'ashis'         NaN   24  105.0

In [119]:
d2=pd.read_csv('mysemi.txt.txt',sep=';')
d2

       name  age  roll
0   'akash'   21   100
1  'akasht'   22   101
2   'sunny'   20   102
3   'bunny'   25   104
4   'ashis'   24   105

# creating a jason file

In [120]:
df6

   id name  age
0   1   ab   45
1   2   rf   25
2   3   kl   41
3   4   ed   30

In [122]:
df6.to_json('myjson.json')

In [123]:
d4=pd.read_json('myjson.json')

In [124]:
d4

   id name  age
0   1   ab   45
1   2   rf   25
2   3   kl   41
3   4   ed   30

In [125]:
df5

   id name  sales
0   1   ab    535
1   2   rf    415
2   3   kl    540
3   4   ed    235

In [127]:
df5.to_csv('mycsvv.csv')  # to create a file

In [128]:
# import numpy as np
# import pandas as pd

In [129]:
# dfm=pd.read_csv('movies.csv')
# dfr=pd.read_csv('ratings.csv')

In [130]:
#dfm.tail()

In [131]:
#dfm.head()

In [132]:
#dfm.info()

In [133]:
#dfm.describe()

In [134]:
#dfm.shape